import { Consultant } from "../types/Consultant";


const mockConsultants : Consultant[] = [
  {
    id: "1",
    name: '李菊红',
    avatar: '/images/doctor1.jpg',
    helpedCount: 3626,
    level: '国家二级咨询师',
    honor: '2021年度优秀咨询师',
    skills: ['个人成长', '情绪管理', '人际关系'],
    description: '拥有十年心理咨询一线工作经验，专注于情绪管理、压力调适与心理韧性建设。在长期实践中，累计陪伴数百位来访者应对焦虑、抑郁、职场倦怠及人际关系困扰，协助识别情绪触发点、调整认知偏差，并建立稳定有效的自我调节策略。咨询方法融合认知行为疗法（CBT）、正念减压（MBSR）与人本主义理念，注重营造安全、非评判的对话空间。擅长为高敏感人群、高压职场人士以及经历重大生活转变的个体提供个性化支持，帮助其在变动中重建内在秩序。风格温和而富有洞察力，在深度共情基础上引导觉察，同时推动具体行动。不仅聚焦于当前困扰的缓解，更重视长期心理适应能力的培养，秉持“预防优于干预”的心理健康理念。通过专业、稳定的陪伴，助力来访者在复杂环境中发展情绪免疫力，找回内在的平衡与力量。'
  },
  {
    id: "2",
    name: '李菊红',
    avatar: '/images/doctor1.jpg',
    helpedCount: 3626,
    level: '国家二级咨询师',
    honor: '2021年度优秀咨询师',
    skills: ['个人成长', '情绪管理', '人际关系'],
    description: '拥有十年心理咨询一线工作经验，专注于情绪管理、压力调适与心理韧性建设。在长期实践中，累计陪伴数百位来访者应对焦虑、抑郁、职场倦怠及人际关系困扰，协助识别情绪触发点、调整认知偏差，并建立稳定有效的自我调节策略。咨询方法融合认知行为疗法（CBT）、正念减压（MBSR）与人本主义理念，注重营造安全、非评判的对话空间。擅长为高敏感人群、高压职场人士以及经历重大生活转变的个体提供个性化支持，帮助其在变动中重建内在秩序。风格温和而富有洞察力，在深度共情基础上引导觉察，同时推动具体行动。不仅聚焦于当前困扰的缓解，更重视长期心理适应能力的培养，秉持“预防优于干预”的心理健康理念。通过专业、稳定的陪伴，助力来访者在复杂环境中发展情绪免疫力，找回内在的平衡与力量。'
  },
  {
    id: "3",
    name: '李菊红',
    avatar: '/images/doctor1.jpg',
    helpedCount: 3626,
    level: '国家二级咨询师',
    honor: '2021年度优秀咨询师',
    skills: ['个人成长', '情绪管理', '人际关系'],
    description: '拥有十年心理咨询一线工作经验，专注于情绪管理、压力调适与心理韧性建设。在长期实践中，累计陪伴数百位来访者应对焦虑、抑郁、职场倦怠及人际关系困扰，协助识别情绪触发点、调整认知偏差，并建立稳定有效的自我调节策略。咨询方法融合认知行为疗法（CBT）、正念减压（MBSR）与人本主义理念，注重营造安全、非评判的对话空间。擅长为高敏感人群、高压职场人士以及经历重大生活转变的个体提供个性化支持，帮助其在变动中重建内在秩序。风格温和而富有洞察力，在深度共情基础上引导觉察，同时推动具体行动。不仅聚焦于当前困扰的缓解，更重视长期心理适应能力的培养，秉持“预防优于干预”的心理健康理念。通过专业、稳定的陪伴，助力来访者在复杂环境中发展情绪免疫力，找回内在的平衡与力量。'
  },
  {
    id: "4",
    name: '李菊红',
    avatar: '/images/doctor1.jpg',
    helpedCount: 3626,
    level: '国家二级咨询师',
    honor: '2021年度优秀咨询师',
    skills: ['个人成长', '情绪管理', '人际关系'],
    description: '拥有十年心理咨询一线工作经验，专注于情绪管理、压力调适与心理韧性建设。在长期实践中，累计陪伴数百位来访者应对焦虑、抑郁、职场倦怠及人际关系困扰，协助识别情绪触发点、调整认知偏差，并建立稳定有效的自我调节策略。咨询方法融合认知行为疗法（CBT）、正念减压（MBSR）与人本主义理念，注重营造安全、非评判的对话空间。擅长为高敏感人群、高压职场人士以及经历重大生活转变的个体提供个性化支持，帮助其在变动中重建内在秩序。风格温和而富有洞察力，在深度共情基础上引导觉察，同时推动具体行动。不仅聚焦于当前困扰的缓解，更重视长期心理适应能力的培养，秉持“预防优于干预”的心理健康理念。通过专业、稳定的陪伴，助力来访者在复杂环境中发展情绪免疫力，找回内在的平衡与力量。'
  },
  {
    id: "5",
    name: '李菊红',
    avatar: '/images/doctor1.jpg',
    helpedCount: 3626,
    level: '国家二级咨询师',
    honor: '2021年度优秀咨询师',
    skills: ['个人成长', '情绪管理', '人际关系'],
    description: '拥有十年心理咨询一线工作经验，专注于情绪管理、压力调适与心理韧性建设。在长期实践中，累计陪伴数百位来访者应对焦虑、抑郁、职场倦怠及人际关系困扰，协助识别情绪触发点、调整认知偏差，并建立稳定有效的自我调节策略。咨询方法融合认知行为疗法（CBT）、正念减压（MBSR）与人本主义理念，注重营造安全、非评判的对话空间。擅长为高敏感人群、高压职场人士以及经历重大生活转变的个体提供个性化支持，帮助其在变动中重建内在秩序。风格温和而富有洞察力，在深度共情基础上引导觉察，同时推动具体行动。不仅聚焦于当前困扰的缓解，更重视长期心理适应能力的培养，秉持“预防优于干预”的心理健康理念。通过专业、稳定的陪伴，助力来访者在复杂环境中发展情绪免疫力，找回内在的平衡与力量。'
  },
  {
    id: "6",
    name: '李菊红',
    avatar: '/images/doctor1.jpg',
    helpedCount: 3626,
    level: '国家二级咨询师',
    honor: '2021年度优秀咨询师',
    skills: ['个人成长', '情绪管理', '人际关系'],
    description: '拥有十年心理咨询一线工作经验，专注于情绪管理、压力调适与心理韧性建设。在长期实践中，累计陪伴数百位来访者应对焦虑、抑郁、职场倦怠及人际关系困扰，协助识别情绪触发点、调整认知偏差，并建立稳定有效的自我调节策略。咨询方法融合认知行为疗法（CBT）、正念减压（MBSR）与人本主义理念，注重营造安全、非评判的对话空间。擅长为高敏感人群、高压职场人士以及经历重大生活转变的个体提供个性化支持，帮助其在变动中重建内在秩序。风格温和而富有洞察力，在深度共情基础上引导觉察，同时推动具体行动。不仅聚焦于当前困扰的缓解，更重视长期心理适应能力的培养，秉持“预防优于干预”的心理健康理念。通过专业、稳定的陪伴，助力来访者在复杂环境中发展情绪免疫力，找回内在的平衡与力量。'
  },
  {
    id: "7",
    name: '李菊红',
    avatar: '/images/doctor1.jpg',
    helpedCount: 3626,
    level: '国家二级咨询师',
    honor: '2021年度优秀咨询师',
    skills: ['个人成长', '情绪管理', '人际关系'],
    description: '拥有十年心理咨询一线工作经验，专注于情绪管理、压力调适与心理韧性建设。在长期实践中，累计陪伴数百位来访者应对焦虑、抑郁、职场倦怠及人际关系困扰，协助识别情绪触发点、调整认知偏差，并建立稳定有效的自我调节策略。咨询方法融合认知行为疗法（CBT）、正念减压（MBSR）与人本主义理念，注重营造安全、非评判的对话空间。擅长为高敏感人群、高压职场人士以及经历重大生活转变的个体提供个性化支持，帮助其在变动中重建内在秩序。风格温和而富有洞察力，在深度共情基础上引导觉察，同时推动具体行动。不仅聚焦于当前困扰的缓解，更重视长期心理适应能力的培养，秉持“预防优于干预”的心理健康理念。通过专业、稳定的陪伴，助力来访者在复杂环境中发展情绪免疫力，找回内在的平衡与力量。'
  }
];

// 模拟网络请求延迟
export async function fetchConsultants(): Promise<Consultant[]> {
    await new Promise((resolve) => setTimeout(resolve, 100));
    return mockConsultants;
}

// 咨询师详情接口
export async function fetchConsultantDetail(consultantId: string): Promise<Consultant | undefined> {
    await new Promise((resolve) =>  setTimeout(resolve, 100) );
    return mockConsultants.find(item => item.id === consultantId);
}